package com.ms.game;

import com.badlogic.gdx.Screen;

public abstract class AbstractScreen implements Screen {
    /**
     * Main class for screens
     *
     * Created by MS
     */

    public String[][] language = {
            /////0///////////1///////////2///////////3////////////////4//////////////////////////////////////5////////////////////////6/////////////7////////////////8/////////////////9///////////////10/////////////11/////////////////12///////////////////////////////13///////////////////////////////////14//////////////////////////15//////////////////////////16////////////17/////////18//////////19///////////////20///////////////////////21/////////////////////////22////////////////////////23/////////////24/////////////////////////////25//////////////////////26//////////////27//////////
            {"Собрано: ", "Монеты: ", "Рекорд: ", "Пауза", "  Продолжить игру  ", "      Вернуться        \n   в меню       ", "  Магазин  ", "   Надеть   ", "    Надето    ", "    Купить    ", "  Одежда  ", "  Бустеры  ", "  Поддержать нас  ", " Купи три части текста и получи уникальныи скин! ", "  Куплено  ", " Недостаточно \n   монет\n для покупки ", " Спасибо! ", "Задачи", "Награда: ", "Получена", "   Строить за ", "   Переработать бумагу!   ", "   Не хватает бумаги!   ", "   Вы получили: ", "А вы знали: ", "   Никнейм Qiwi кошелька: RIAND915   ", " Трек ", "Сейчас играет трек "},
            /////0///////////1//////////2///////////3///////////////4//////////////////////////////////////////5///////////////////////////6////////////////7//////////////8///////////////9///////////////10/////////////////11////////////////12///////////////////////////////13////////////////////////////14//////////////////////////15/////////////////////////16/////////////17///////////18//////////19//////////////20///////////////////21//////////////////////////////22///////////////////////23//////////////24/////////////////////////////////25////////////////////////////26///////////////27////////////
            {"Collected: ", "Coins: ", "Record: ", "Pause", "  Continue game  ", "        Return          \n      to menu         ", "     Shop    ", "  Equip   ", "    Wearing    ", "    Buy    ", "   Clothes   ", "   Busters   ", "   Donate   ", " Buy 3 parts of text and get the unique skin! ", "  Purchased  ", " You haven't \n got enough\n money ", " Thank you! ", "Challenges", "Reward: ", "Received", "   Build for ", "   Recycle paper now!   ", "   You haven't enough paper!   ", "   You gain: ", "Do you know: ", "   Nickname of the Qiwi wallet: RIAND915   ", " Track ", "Now is playing track "}};
    private int lang;
    ////////////////////////////////////////0/////////1/////////2//////////3///////4///////5/////////6///////7/////////8//////////9////////////////10///////11///12///13////14////15////16//////17///////////18//////////////////19////////////////////////20/////////////////21//////////22/////23//////24/////25//////26////27///////////28////////////29/////////////30//////31///
    public String[][] challengeLang = {{"Соберите ", "/", " кг бумаги", "1000", "5000", "10000", "25000", "50000", "100000", "Использовано ", " бустеров", "3", "5", "10", "20", "30", "50", "Сделано ", " прыжков", "Собрать уникальный скин", "Открыть 5 разных скинов", "Играть ", " часов", "1" , " час ", "30", " мин", "2", "Построить завод", "Переработать ", "500", " часа"},
            ////0/////////1///////////2/////////3///////4///////5////////6////////7/////////8////////9/////////10///////11///12///13////14////15////16/////17////////18/////////////////19////////////////////////20///////////////21//////////22////23//////24//////25//////26////27/////////28///////////29/////////30//
            {"Collect ", "/", " kg of paper", "1000", "5000", "10000", "25000", "50000", "100000", "Used ", " busters", "3", "5", "10", "20", "30", "50", "Made ", " jumps", "Get the unique skin", "Open 5 different clothes", "Play for ", " hours", "1", " hour ", "30", " min", "2", "Build factory", "Recycle ", "500"}};

    public int getLang() {
        return lang;
    }

    public void setLang(int lang) {
        this.lang = lang;
    }

    /**
     * Resize method
     * @param width - wight
     * @param height - height
     */
    @Override
    public void resize(int width, int height) {
        ScreenManager.getInstance().resize(width, height);
    }

    /**
     * Pause method
     */
    @Override
    public void pause() {

    }

    /**
     * Resume method
     */
    @Override
    public void resume() {

    }

    /**
     * Hide method
     */
    @Override
    public void hide() {

    }

}
